In [1]:
import numpy as np
import pandas as pd

In [2]:
s='prateek.rathore@gmail.com'
n=s.index('@')
print(n)

15

In [3]:
s[n+1:]

'gmail.com'

In [4]:
s[:n]

'prateek.rathore'

In [5]:
#Multiple Indexing

id="pankaj12kumbh@gmail.com"
m='@'
p=([a for a ,char in enumerate (id) if char==m])
print(p)

[13]

In [6]:
w="the quick brown fox jumps over the lazy dog. the cow jumps over the moon. the dog fox apple black brown."
wc={}
w=w.replace("\n"," ")
w=w.replace("."," ")
print(w)

the quick brown fox jumps over the lazy dog  the cow jupms over the moon  the dog fox apple black brown

In [9]:
for wa in w.split(" "):
    wc[wa]=len(wa)
    if len(wa)>0:
        if wa == "the":
            wc[wa]=wc.get(wa,0)+1
            print(wc.get(wa,0)+1)

5
5
5
5
5

In [10]:
print(wc)

{'the': 4, 'quick': 5, 'brown': 5, 'fox': 3, 'jumps': 5, 'over': 4, 'lazy': 4, 'dog': 3, 'cow': 3, 'jupms': 5, 'moon': 4, 'apple': 5, 'black': 5, '': 0}

In [12]:
from collections import Counter
x=Counter(w)
print(x)

Counter({' ': 23, 'o': 11, 'e': 8, 't': 5, 'h': 5, 'r': 4, 'p': 4, 'u': 3, 'c': 3, 'b': 3, 'w': 3, 'n': 3, 'm': 3, 'l': 3, 'a': 3, 'k': 2, 'f': 2, 'x': 2, 'j': 2, 's': 2, 'v': 2, 'd': 2, 'g': 2, 'q': 1, 'i': 1, 'z': 1, 'y': 1})

In [13]:
s="abbcccddddeeeee"
from collections import Counter
x=Counter(s)
print(x)

Counter({'e': 5, 'd': 4, 'c': 3, 'b': 2, 'a': 1})

In [14]:
s="Hello, please meet me at 4pm @ coffee house or email me python@gmail.com" 
s1=s.split()
print(s1)
word=input('Enter Your word')
count=0
for i in s1:
    if(i==word):
        print("Occurance of your word is: ",count)

['Hello,', 'please', 'meet', 'me', 'at', '4pm', '@', 'coffee', 'house', 'or', 'email', 'me', 'python@gmail.com']

Enter Your word 4pm

Occurance of your word is:  0

In [15]:
s1=s[55: :]
print(s1)
a=s1.split('.')[0]
print(a)

 python@gmail.com
 python@gmail

In [16]:
a=(1,2,[4,5,6],7)
print(type(a))

<class 'tuple'>

In [17]:
b=[1,2,3,4]
b[1]=100
b

[1, 100, 3, 4]

In [18]:
a[2]

[4, 5, 6]

In [21]:
a[2][1]=100
a

(1, 2, [4, 100, 6], 7)

In [22]:
# MAP  AND REDUCE
num=['3','4','5']
new_num=list(map(int,num))
print(f'{num} list string values changes to new number {new_num}')

['3', '4', '5'] list string values changes to new number [3, 4, 5]

In [23]:
#Filter
mlist=[1,5,4,6,8,11,3,12]
x1=list(filter(lambda x:(x%2==0),mlist))
print(list(filter(lambda x:(x%2==0),mlist)))
print(x1)

[4, 6, 8, 12]
[4, 6, 8, 12]

In [24]:
#REDUCE
from functools import reduce
num1=[1,2,3,4,5]
new_num=reduce(lambda x,y:x+y, num1)
new_num

15

In [26]:
d=pd.DataFrame(data={'Animal':['cat','peguin','dog','spider','snake'],'Number_legs':[4,2,4,8,np.nan]})
d

   Animal  Number_legs
0     cat          4.0
1  peguin          2.0
2     dog          4.0
3  spider          8.0
4   snake          NaN

In [27]:
d['mr']=d['Number_legs'].rank(method='max')
d['dense_Rank']=d['Number_legs'].rank(method='dense',ascending=False)
d['Min_Rank']=d['Number_legs'].rank(method='min')
d

   Animal  Number_legs   mr  dense_Rank  Min_Rank
0     cat          4.0  3.0         2.0       2.0
1  peguin          2.0  1.0         3.0       1.0
2     dog          4.0  3.0         2.0       2.0
3  spider          8.0  4.0         1.0       4.0
4   snake          NaN  NaN         NaN       NaN

In [28]:
emp=pd.DataFrame(data={'Emp_Name':['Farhan','arti','Shirish','Sreekar','Adil','Shrit'],
                      'Salary':[10000,20000,15000,23000,45000,30000],
                      'Dept':['IT','IT','IT','Sales','Sales','Sales'],
                      'age':[23,22,27,23,22,24]})

In [30]:
emp['Max_Rank']=emp['Salary'].rank(method='max')
emp.groupby('Dept').Salary.mean()

Dept
IT       15000.000000
Sales    32666.666667
Name: Salary, dtype: float64

In [31]:
emp['Rank']=emp.groupby('Dept').Salary.rank(method='dense',ascending=False)
emp[(emp['Rank']<3)]

  Emp_Name  Salary   Dept  age  Max_Rank  Rank
1     arti   20000     IT   22       3.0   1.0
2  Shirish   15000     IT   27       2.0   2.0
4     Adil   45000  Sales   22       6.0   1.0
5    Shrit   30000  Sales   24       5.0   2.0

In [33]:
emp.groupby('Dept').Salary.agg(['Count','max','min'])

AttributeError: 'SeriesGroupBy' object has no attribute 'Count'

In [34]:
emp.groupby('Dept').Salary.mean()

Dept
IT       15000.000000
Sales    32666.666667
Name: Salary, dtype: float64

In [35]:
#DECORATORS:

def fun(fun1):
    fun1("Pankaj")
fun1=print
fun(fun1)

Pankaj

In [36]:
def d(fun1):
    def nowexe():
        print("Executing Now.....")
        fun1()
        print("Executed..")
    return(nowexe)
def who_is_harry():
    print("Harry is a good Boy")
who_is_harry=d(who_is_harry)
who_is_harry()

Executing Now.....
Harry is a good Boy
Executed..

In [37]:
emp

  Emp_Name  Salary   Dept  age  Max_Rank  Rank
0   Farhan   10000     IT   23       1.0   3.0
1     arti   20000     IT   22       3.0   1.0
2  Shirish   15000     IT   27       2.0   2.0
3  Sreekar   23000  Sales   23       4.0   3.0
4     Adil   45000  Sales   22       6.0   1.0
5    Shrit   30000  Sales   24       5.0   2.0

In [38]:
emp_list=['Farhaan','Sreekar']
emp[emp['Emp_Name'].isin(emp_list)]

  Emp_Name  Salary   Dept  age  Max_Rank  Rank
3  Sreekar   23000  Sales   23       4.0   3.0

In [39]:
#APPLY FUNCTION

In [40]:
emp.age.astype(int)

0    23
1    22
2    27
3    23
4    22
5    24
Name: age, dtype: int32

In [46]:
def age_category(x):
    if int(x)<25:
        return('Young')
    else:
        return('Adult')

In [47]:
emp['age_category']=emp['age'].apply(age_category)
emp

  Emp_Name  Salary   Dept  age  Max_Rank  Rank age_category
0   Farhan   10000     IT   23       1.0   3.0        Young
1     arti   20000     IT   22       3.0   1.0        Young
2  Shirish   15000     IT   27       2.0   2.0        Adult
3  Sreekar   23000  Sales   23       4.0   3.0        Young
4     Adil   45000  Sales   22       6.0   1.0        Young
5    Shrit   30000  Sales   24       5.0   2.0        Young

In [51]:
emp['Age_mul']=emp['age'].apply(lambda x:int(x)*2)

In [53]:
emp

  Emp_Name  Salary   Dept  age  Max_Rank  Rank age_category  Age_mul
0   Farhan   10000     IT   23       1.0   3.0        Young       46
1     arti   20000     IT   22       3.0   1.0        Young       44
2  Shirish   15000     IT   27       2.0   2.0        Adult       54
3  Sreekar   23000  Sales   23       4.0   3.0        Young       46
4     Adil   45000  Sales   22       6.0   1.0        Young       44
5    Shrit   30000  Sales   24       5.0   2.0        Young       48

In [54]:
x=[]
for i in range(0,5):
    a=input('Enter your name:')
    x.append(a) 
print(x)

Enter your name: Pankaj
Enter your name: Prateek
Enter your name: Shruti
Enter your name: Sridhar
Enter your name: Sreekar

['Pankaj', 'Prateek', 'Shruti', 'Sridhar', 'Sreekar']